lidcavity/data/constant/transportProperties
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object transportProperties;
}

nu 1e-05;



// ************************************************************************* //